---
title: MEPHiddenLineSettings
classe: Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings
namespace: Autodesk.Revit.DB.Mechanical
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# MEPHiddenLineSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean DrawHiddenLine { get; set; }` | `mEPHiddenLineSettings.DrawHiddenLine` | Boolean |
| `Double InsideGap { get; set; }` | `mEPHiddenLineSettings.InsideGap` | Double |
| `ElementId LineStyle { get; set; }` | `mEPHiddenLineSettings.LineStyle` | ElementId |
| `Double OutsideGap { get; set; }` | `mEPHiddenLineSettings.OutsideGap` | Double |
| `Double SingleLineGap { get; set; }` | `mEPHiddenLineSettings.SingleLineGap` | Double |
| `MEPHiddenLineSettings GetMEPHiddenLineSettings(Document)` | `MEPHiddenLineSettings.GetMEPHiddenLineSettings(doc)` | MEPHiddenLineSettings |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```